Repository: Hero-oo/Openswan_v3.0.0_comment
Catalog: debian/po/*.po
Languages: es

source: Old runlevel management superseded
es: Se ha reemplazado la antigua gesti�n del nivel de ejecuci�n

source: Previous versions of the Openswan package gave a choice between three different Start/Stop-Levels. Due to changes in the standard system startup procedure, this is no longer necessary or useful. For all new installations as well as old ones running in any of the predefined modes, sane default levels will now be set. If you are upgrading from a previous version and changed your Openswan startup parameters, then please take a look at NEWS.Debian for instructions on how to modify your setup accordingly.
es: Las versiones anteriores del paquete Openswan proporcionaban tres niveles diferentes de inicio y parada. Debido a cambios en el procedimiento de inicio del sistema est�ndar, esto no es necesario ni �til. Para todas las nuevas instalaciones as� como para las viejas que se ejecuten en cualquiera de los modos predefinidos, se asignar�n los niveles correctos de forma predeterminada. Si est� actualizando desde una versi�n anterior y cambi� los par�metros de inicio de Openswan, consulte �NEWS.Debian� en busca de instrucciones sobre como modificar la configuraci�n de forma apropiada.

source: Restart Openswan now?
es: �Desea reiniciar Openswan ahora?

source: Restarting Openswan is recommended, since if there is a security fix, it will not be applied until the daemon restarts. Most people expect the daemon to restart, so this is generally a good idea. However, this might take down existing connections and then bring them back up, so if you are using such an Openswan tunnel to connect for this update, restarting is not recommended.
es: Se recomienda reiniciar Openswan, ya que si hay un error de seguridad corregido, �ste no se arreglar� hasta que el demonio se reinicie. La mayor�a de la gente espera que el demonio se reinicie, as� que generalmente es una buena idea. Sin embargo, esto puede interrumpir las conexiones existentes para luego recuperarlas, de modo que si est� utilizando un t�nel de Openswan para la conexi�n de esta actualizaci�n, no se recomienda reiniciar.

source: Use an X.509 certificate for this host?
es: �Desea utilizar un certificado X.509 para este equipo?

source: An X.509 certificate for this host can be automatically created or imported. It can be used to authenticate IPsec connections to other hosts and is the preferred way of building up secure IPsec connections. The other possibility would be to use shared secrets (passwords that are the same on both sides of the tunnel) for authenticating a connection, but for a larger number of connections, key based authentication is easier to administer and more secure.
es: Se puede crear autom�ticamente o importar un certificado X.509 para este equipo. Este se puede utilizar para autenticar las conexiones IPsec con otros equipos y es la forma preferida para crear conexiones IPsec seguras. La otra posibilidad ser�a utilizar contrase�as compartidas (contrase�as que son iguales en ambos lados del t�nel) para autenticar una conexi�n, pero para muchas conexiones, la autenticaci�n basada en claves es m�s sencilla de administrar y m�s segura.

source: Alternatively you can reject this option and later use the command "dpkg-reconfigure openswan" to come back.
es: Puede rechazar esta opci�n y, m�s tarde, utilizar la orden �dpkg-reconfigure openswan� para cambiarla.

source: create
es: crear

source: import
es: importar

source: Methods for using a X.509 certificate to authenticate this host:
es: M�todos para usar un certificado X.509 para autenticar este equipo:

source: It is possible to create a new X.509 certificate with user-defined settings or to import an existing public and private key stored in PEM file(s) for authenticating IPsec connections.
es: Es posible crear un certificado X.509 nuevo con una configuraci�n definida por el usuario o importar un par de claves (p�blica/privada) almacenado en un archivo PEM para autenticar las conexiones IPsec.

source: If you choose to create a new X.509 certificate you will first be asked a number of questions which must be answered before the creation can start. Please keep in mind that if you want the public key to get signed by an existing Certificate Authority you should not select to create a self-signed certificate and all the answers given must match exactly the requirements of the CA, otherwise the certificate request may be rejected.
es: Si escoge crear un certificado X.509 nuevo, primero deber� contestar a unas cuantas preguntas antes de que comience la creaci�n. Tenga en cuenta que si quiere que la clave p�blica la firme una Autoridad de Certificaci�n (CA) no deber�a crear un certificado auto-firmado y todas las respuestas deben coincidir exactamente con los requisitos de la CA, de otro modo se rechazar� la solicitud del certificado.

source: If you want to import an existing public and private key you will be prompted for their filenames (which may be identical if both parts are stored together in one file). Optionally you may also specify a filename where the public key(s) of the Certificate Authority are kept, but this file cannot be the same as the former ones. Please also be aware that the format for the X.509 certificates has to be PEM and that the private key must not be encrypted or the import procedure will fail.
es: Si quiere importar un par de claves (p�blica/privada) existente, se le preguntar� por los nombres de los archivos (puede que sean id�nticos si ambas claves est�n almacenadas en el mismo archivo). Opcionalmente, tambi�n puede introducir el nombre de archivo d�nde la/s clave/s p�blica/s de la Autoridad de Certificaci�n est�n almacenadas, pero este archivo puede no ser el mismo que los anteriores. Por favor, tambi�n tenga en cuenta que el formato de los certificados X.509 tiene que ser PEM y que la clave privada no debe estar cifrada o el proceso de importaci�n fallar�.

source: File name of your PEM format X.509 certificate:
es: Nombre del archivo del certificado X.509 en formato PEM:

source: Please enter the location of the file containing your X.509 certificate in PEM format.
es: Introduzca la ubicaci�n del archivo que contiene el certificado X.509 en formato PEM.

source: File name of your PEM format X.509 private key:
es: Nombre del archivo de la clave privada X.509 en formato PEM:

source: Please enter the location of the file containing the private RSA key matching your X.509 certificate in PEM format. This can be the same file that contains the X.509 certificate.
es: Introduzca la ubicaci�n del archivo que contiene la clave privada RSA que corresponde al certificado X.509 en formato PEM. Puede ser el mismo archivo que contiene el certificado X.509.

source: File name of your PEM format X.509 RootCA:
es: Nombre del archivo de la CA ra�z X.509 en formato PEM:

source: Optionally you can now enter the location of the file containing the X.509 Certificate Authority root used to sign your certificate in PEM format. If you do not have one or do not want to use it please leave the field empty. Please note that it's not possible to store the RootCA in the same file as your X.509 certificate or private key.
es: Opcionalmente puede introducir la ubicaci�n del archivo que contiene la Autoridad de Certificaci�n ra�z X.509 para firmar el certificado en formato PEM. Si no tiene uno o no quiere utilizarlo deje el campo en blanco. Tenga en cuenta que no es posible almacenar la CA ra�z en el mismo archivo que el certificado X.509 o la clave privada.

source: Length of RSA key to be created:
es: Longitud de la calve RSA a crear:

source: Please enter the required RSA key-length. Anything under 1024 bits should be considered insecure; anything more than 4096 bits slows down the authentication process and is not useful at present.
es: Introduzca la longitud de la clave RSA necesaria. Cualquier longitud menor que 1024 bits se considera insegura, y cualquier longitud mayor que 4096 bits ralentizar� el proceso de autenticaci�n y en este momento no es �til.

source: Create a self-signed X.509 certificate?
es: �Desea crear un certificado X.509 auto-firmado?

source: Only self-signed X.509 certificates can be created automatically, because otherwise a Certificate Authority is needed to sign the certificate request. If you choose to create a self-signed certificate, you can use it immediately to connect to other IPsec hosts that support X.509 certificate for authentication of IPsec connections. However, using Openswan's PKI features requires all certificates to be signed by a single Certificate Authority to create a trust path.
es: S�lo se pueden crear autom�ticamente certificados X.509 auto-firmados, porque de otro modo se necesitar� una Autoridad de Certificaci�n para firmar la solicitud del certificado. Si escoge crear un certificado auto-firmado, puede utilizarlo inmediatamente para conectar con otros equipos IPsec que permitan utilizar certificados X.509 para la autenticaci�n de las conexiones IPsec. Sin embargo, para utilizar las funcionalidades PKI de Openswan se necesita que todos los certificados est�n firmados por una �nica Autoridad de Certificaci�n para crear una ruta segura.

source: If you do not choose to create a self-signed certificate, only the RSA private key and the certificate request will be created, and you will have to sign the certificate request with your Certificate Authority.
es: Si no desea crear un certificado auto-firmado, entonces s�lo se crear�n la clave privada RSA y la solicitud del certificado, y usted tendr� que firmar la solicitud del certificado con una Autoridad de Certificaci�n.

source: Country code for the X.509 certificate request:
es: C�digo del pa�s para la solicitud del certificado X.509:

source: Please enter the two-letter code for the country the server resides in (such as "AT" for Austria).
es: Introduzca las dos letras del c�digo del pa�s en el que est� ubicado el servidor (por ejemplo: �ES� para Espa�a).

source: OpenSSL will refuse to generate a certificate unless this is a valid ISO-3166 country code; an empty field is allowed elsewhere in the X.509 certificate, but not here.
es: OpenSSL no generar� un certificado a menos que este campo sea un c�digo de pa�s ISO-3166 v�lido, el campo se puede dejar en blanco para los certificados X.509, pero no en este caso.

source: State or province name for the X.509 certificate request:
es: Estado o provincia para la solicitud del certificado X.509:

source: Please enter the full name of the state or province the server resides in (such as "Upper Austria").
es: Introduzca el nombre completo del estado o la provincia en el que est� ubicado el servidor (por ejemplo: �Comunidad de Madrid�).

source: Locality name for the X.509 certificate request:
es: Localidad para la solicitud del certificado X.509:

source: Please enter the locality the server resides in (often a city, such as "Vienna").
es: Introduzca la localidad d�nde est� ubicado el servidor (normalmente una ciudad, por ejemplo: �Madrid�).

source: Organization name for the X.509 certificate request:
es: Nombre de la organizaci�n para la solicitud del certificado X.509:

source: Please enter the organization the server belongs to (such as "Debian").
es: Introduzca el nombre de la organizaci�n a la que el servidor pertenece (por ejemplo: �Debian�).

source: Organizational unit for the X.509 certificate request:
es: Unidad organizacional para la solicitud del certificado X.509:

source: Please enter the organizational unit the server belongs to (such as "security group").
es: Introduzca la unidad organizacional a la que el servidor pertenece (por ejemplo: �departamento de seguridad�).

source: Common Name for the X.509 certificate request:
es: Nombre com�n para la solicitud del certificado X.509:

source: Please enter the Common Name for this host (such as "gateway.example.org").
es: Introduzca el nombre com�n para este equipo (por ejemplo: �enlace.ejemplo.org�).

source: Email address for the X.509 certificate request:
es: Direcci�n de correo electr�nico para la solicitud del certificado X.509:

source: Please enter the email address of the person or organization responsible for the X.509 certificate.
es: Introduzca la direcci�n de correo electr�nico de la persona u organizaci�n responsable del certificado X.509.

source: Modification of /etc/ipsec.conf
es: Modificaci�n del archivo �/etc/ipsec.conf�

source: Due to a change in upstream Openswan, opportunistic encryption is no longer enabled by default. The no_oe.conf file that was shipped in earlier versions to explicitly disable it can therefore no longer be included by ipsec.conf. Any such include paragraph will now be automatically removed to ensure that Openswan can start correctly.
es: Debido a cambios en el desarrollo principal de Openswan, el cifrado oportun�stico no est� activado de forma predeterminada. El archivo �no_oe.conf� que se distribu�a en las versiones anteriores para desactivarlo expl�citamente no se puede incluir m�s en �ipsec.conf�. Se borrar� autom�ticamente cualquier p�rrafo de inclusi�n para asegurar que Openswan se ejecuta correctamente.
